outline.tex
% Created 2013-11-16 Sat 15:07
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Addressing Undersegmentation in Cell Tracking}
\author{Philipp Hanslovsky}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\section{Introduction}
\label{sec-1}
\subsection{Cell Tracking in Developmental Biology}
\label{sec-1-1}
\subsection{Contributions}
\label{sec-1-2}
\subsubsection{Merger-Resolution}
\label{sec-1-2-1}
\subsubsection{Joint Segmentation and Tracking}
\label{sec-1-2-2}
\subsection{Structure of the Document}
\label{sec-1-3}
\section{Related Work}
\label{sec-2}

  might be part of Theory section
\section{Cell Tracking}
\label{sec-3}
\subsection{Requirements and Challenges}
\label{sec-3-1}

   divisible, indistinguishable objects
\subsection{Approaches}
\label{sec-3-2}
\subsubsection{Tracking by Assignment}
\label{sec-3-2-1}

    detect object candidates; then do tracking on the object level
\section{Graphical Models and Tracking}
\label{sec-4}

  Used for modelling probability distributions\ldots{}
\subsection{Factor Graphs}
\label{sec-4-1}

   Two kinds of nodes: factors and RVs
\subsection{Tracking as a Factor Graph}
\label{sec-4-2}

   Tracking represented by fg
\subsubsection{Chaingraph Tracking}
\label{sec-4-2-1}

    model etc pp
\subsubsection{Conservation Tracking}
\label{sec-4-2-2}

    model etc pp
    
\section{Segmentation}
\label{sec-5}
\subsection{Pixel Classification}
\label{sec-5-1}
\section{Addressing Undersegmentation}
\label{sec-6}
\subsection{GMM for Conservation Tracking}
\label{sec-6-1}
\subsection{Joint Segmentation and Tracking}
\label{sec-6-2}
\subsubsection{Overview}
\label{sec-6-2-1}
\subsubsection{Oversegmentation}
\label{sec-6-2-2}
\subsubsection{Region Merging}
\label{sec-6-2-3}
\subsubsection{Factors}
\label{sec-6-2-4}
\subsubsection{Constraints}
\label{sec-6-2-5}
\subsubsection{Features}
\label{sec-6-2-6}
\subsubsection{Classifiers}
\label{sec-6-2-7}
\section{Experiments}
\label{sec-7}
\subsection{Data Description}
\label{sec-7-1}
\subsection{Merger-Resolution}
\label{sec-7-2}
\subsubsection{Evaluation Measures}
\label{sec-7-2-1}
\subsubsection{Results and Comparison}
\label{sec-7-2-2}
\subsection{Joint Segmentation and Tracking}
\label{sec-7-3}
\subsubsection{Evaluation Measures}
\label{sec-7-3-1}
\subsubsection{Results and Comparison}
\label{sec-7-3-2}
\section{Discussion}
\label{sec-8}
\subsection{Conclusion}
\label{sec-8-1}
\subsection{Limitations}
\label{sec-8-2}
\subsection{Future Work}
\label{sec-8-3}

\end{document}
